app/views/trees/index.html.erb

SELECT "types".* FROM "types"
---
                <td>
                  <%= f.input :type_id,
                              label: false,
                              collection: Type.all,
                              required: true,
                              prompt: 'Type',
                              label_method: lambda {|p| p.name },
                              input_html: { class: 'form-control'} %>