app/views/orders/_balsam_fraser.html.erb

        <h4>Name: Abies balsamea</h4>
        <h4>Heights: <%= Tree.all.includes(:type).select { |tree| tree.type.name == 'Balsam Fir' }.map(&:height).sort.join(', ') %>ft.</h4>
---
SELECT  "types".* FROM "types"  WHERE "types"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "trees".* FROM "trees"  WHERE "trees"."id" IN (11, 12, 4, 2, 3)