app/views/orders/new.html.erb

SELECT  "windows".* FROM "windows"   ORDER BY "windows"."id" ASC LIMIT 1
---
            <h3>When would you like your tree delivered?</h3>
            <%= f.input :window_id,
                        required: true,
                        label: false,
                        collection: @windows,
                        selected: @windows.first,
                        label_method: :delivery_window,
                        input_html: { class: 'form-control'} %>