app/views/orders/order_confirmation.html.erb

SELECT "accessories".* FROM "accessories" INNER JOIN "accessory_orders" ON "accessories"."id" = "accessory_orders"."accessory_id" WHERE "accessory_orders"."order_id" = $1  [["order_id", 18]]
---
      <ul class="list-group">
          <% @order.accessories.each do |a| %>