app/views/lots/show.html.erb

SELECT  "windows".* FROM "windows"  WHERE "windows"."id" = $1 LIMIT 1  [["id", 1]]
---
                  <td><%= order.tree.nil? ? 'deleted' : order.tree.height.to_s + " ft. " + order.tree.type.name %></td>
                  <td><%= order.window.delivery_window if order.window.present? %></td>