app/controllers/accessories_controller.rb

SELECT "accessories".* FROM "accessories"
---
  def index
    @accessories = Accessory.all

INSERT INTO "accessories" ("created_at", "description", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-10 15:18:27.632987"], ["description", "Larger Traditional Door adornment"], ["name", "Wreath 25 inch"], ["price", 49.99], ["updated_at", "2014-11-10 15:18:27.632987"]]
---
  def create
    @accessory = Accessory.new(accessory_params)

    if @accessory.save

SELECT  "accessories".* FROM "accessories"  WHERE "accessories"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "accessories" SET "name" = $1, "updated_at" = $2 WHERE "accessories"."id" = 2  [["name", "Kissing Balls"], ["updated_at", "2014-11-10 16:00:59.595248"]]
---
  def update
    @accessory = Accessory.find(params[:id])

    respond_to do |format|
      if @accessory.update_attributes(accessory_params)

SELECT  "accessories".* FROM "accessories"  WHERE "accessories"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "accessories" WHERE "accessories"."id" = 10
---
  def destroy
    @accessory = Accessory.find(params[:id])

    if @accessory.delete