app/controllers/available_trees_controller.rb

SELECT  "lots".* FROM "lots"  WHERE "lots"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "trees".* FROM "trees"  WHERE "trees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "available_trees" ("lot_id", "tree_id") VALUES ($1, $2) RETURNING "id"  [["lot_id", 1], ["tree_id", 1]]
---
  def create
    @lot = Lot.find(params[:available_tree][:lot_id])
    @available_tree = @lot.available_trees.new(available_tree_params)

    if @available_tree.save

SELECT  "lots".* FROM "lots"  WHERE "lots"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "available_trees".* FROM "available_trees"  WHERE "available_trees"."lot_id" = $1 AND "available_trees"."tree_id" IS NULL  [["lot_id", 1]]
DELETE FROM "available_trees" WHERE "available_trees"."id" = $1  [["id", 1]]
---
  def destroy
    @lot = Lot.find(params[:lot_id])
    @tree = params[:id]
    @available_tree = @lot.available_trees.where(tree_id: @tree)
    @available_tree.destroy_all if @available_tree