app/controllers/lots_controller.rb

SELECT  "lots".* FROM "lots"  WHERE "lots"."id" = 1  ORDER BY "lots"."id" ASC LIMIT 1
SELECT "zips".* FROM "zips"  WHERE "zips"."lot_id" = 1
SELECT "orders".* FROM "orders"  WHERE "orders"."lot_id" = 1 AND "orders"."delivered" = 'f'
SELECT "trees".* FROM "trees"  WHERE "trees"."lot_id" = 1
SELECT "types".* FROM "types"  WHERE "types"."id" IN (1, 2)
---
  def show
    @lot = Lot.find(params[:id])
    @new_zip = Zip.new
    @delivery_zipcodes = Zip.where(lot_id: @lot.id)
    @orders = Order.where(lot_id: @lot.id, delivered: false)
    @delivered = Order.where(lot_id: @lot.id, delivered: true)
    @trees = Tree.all.includes(:type)

SELECT "orders".* FROM "orders"  WHERE "orders"."lot_id" IS NULL
---
  def open_orders
    @orders = Order.where(lot_id: nil)