app/controllers/orders_controller.rb

SELECT  "windows".* FROM "windows"   ORDER BY "windows"."id" ASC LIMIT 1
SELECT "accessories".* FROM "accessories"
---
  def new
    @zip = params[:zip]
    @available_trees, @trees = Order.available_trees(@zip)
    if @zip.nil?
      flash[:notice] = "We need a zipcode!"
      redirect_to orders_path
    elsif @available_trees.empty?
      flash[:notice] = "Sorry we dont have any trees in that area!"
      redirect_to orders_path
    end
    @geo = Geokit::Geocoders::MultiGeocoder.geocode(@zip)
    if @geo.success
      @state = @geo.state
      @city = @geo.city
    end
    @order = Order.new
    @windows = Window.all
    @accessories = Accessory.all

INSERT INTO "orders" ("address", "city", "created_at", "email", "instructions", "name", "state", "tree_id", "updated_at", "window_id", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    if @order.save

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "trees".* FROM "trees"  WHERE "trees"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "accessories".* FROM "accessories" INNER JOIN "accessory_orders" ON "accessories"."id" = "accessory_orders"."accessory_id" WHERE "accessory_orders"."order_id" = $1  [["order_id", 18]]
---
  def order_confirmation
    @order = Order.find(params[:id])
    @accessories = @order.accessories
    @total = @accessories.empty? ? @order.tree.price : @order.tree.price + @accessories.inject(0){ |sum, a| sum + a.price }

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "orders" SET "lot_id" = $1, "updated_at" = $2 WHERE "orders"."id" = 1  [["lot_id", 1], ["updated_at", "2014-10-03 19:40:58.128718"]]
---
  def order_claim
    @order = Order.find(params[:order_id])
    @order.lot_id = current_lot.id

    if @order.save

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "orders" SET "lot_id" = $1, "updated_at" = $2 WHERE "orders"."id" = 1  [["lot_id", nil], ["updated_at", "2014-10-03 19:48:44.060913"]]
---
  def order_release
    @order = Order.find(params[:order_id])
    @order.lot_id = nil

    if @order.save

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "orders" SET "delivered" = $1, "updated_at" = $2 WHERE "orders"."id" = 2  [["delivered", "t"], ["updated_at", "2014-10-06 14:56:30.552100"]]
---
  def order_delivered
    @order = Order.find(params[:order_id])
    @order.delivered = true

    if @order.save

SELECT "lots".* FROM "lots"  WHERE "lots"."id" IN (1)
SELECT "zips".* FROM "zips"  WHERE "zips"."code" = 2145
SELECT "zips".* FROM "zips"
SELECT COUNT(*) FROM "available_trees"  WHERE "available_trees"."lot_id" = $1  [["lot_id", 1]]
SELECT COUNT(*) FROM "zips"  WHERE "zips"."code" IS NULL
---
  def zipcode_search
    @zip = params[:zipcode_search][:zipcode]

    @count = 0

    @zips = Zip.where(code: @zip).includes(:lot)

    @zips.each do |zip|
      @count += zip.lot.available_trees.count
    end

    if @zips.size > 0 && @count > 0