app/controllers/trees_controller.rb

SELECT "trees".* FROM "trees"
SELECT "types".* FROM "types"  WHERE "types"."id" IN (1, 2)
---
  def index
    @trees = Tree.all.includes(:type)

INSERT INTO "trees" ("height", "price", "type_id") VALUES ($1, $2, $3) RETURNING "id"  [["height", nil], ["price", nil], ["type_id", 2]]
---
  def create
    @tree = Tree.new(tree_params)

    if @tree.save

SELECT  "trees".* FROM "trees"  WHERE "trees"."id" = $1 LIMIT 1  [["id", 18]]
UPDATE "trees" SET "type_id" = $1 WHERE "trees"."id" = 18  [["type_id", 1]]
---
  def update
    @tree = Tree.find(params[:id])

    respond_to do |format|
      if @tree.update_attributes(tree_params)

SELECT  "trees".* FROM "trees"  WHERE "trees"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "trees" WHERE "trees"."id" = $1  [["id", 1]]
---
  def destroy
    @tree = Tree.find(params[:id])
    if @tree.destroy