app/controllers/zips_controller.rb

  def create
    @zip = Zip.new(zip_params)
    if @zip.save
---
INSERT INTO "zips" ("code", "lot_id") VALUES ($1, $2) RETURNING "id"  [["code", 2145], ["lot_id", 1]]

  def destroy
    @zip = Zip.find(params[:id])
    @zip.destroy
---
SELECT  "zips".* FROM "zips"  WHERE "zips"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "zips" WHERE "zips"."id" = $1  [["id", 4]]